Feature: 查询网上订单
  Background: 清空原有订单信息
    Given 清空原有订单信息

  @UI
  Scenario: UI查询网上订单
    Given 	生成网上订单
    When 	跳转到网上订单管理页面
    And     网上订单UI录入精确查询数据
    Then    列表中存在该订单
    And     点击清空按钮查询
    Then    列表中存在该订单
    And     点击跳转到下一页
    Then    列表中不存在该订单


#  Scenario: 查询网上订单-默认查询测试
#    Given 	生成网上订单
#    When 	查询网上订单
#    Then 	校验查询结果中包含新建的网上订单
#
#  Scenario: 全空查询
#    Given 	跳转到网上订单列表页面
#    When 	操作 查询
#    Then 	查询结果显示
#    And 	查询成功
#
#
#  Scenario: 录入相关信息查询
#    Given 	跳转到网上订单列表页面
#    When 	操作 录入信息
#      |网上订单|网上订单|||||||付款时间|下载时间|发货时间|订单金额|商品数量|商品编号|条形码|地址||
#      |    |    |||||||    |    |    |    |    |
#    And     操作 查询
#    Then 	查询结果显示
#    And 	查询成功
#
#
#
#
#  Scenario: 录入错误信息查询
#    Given 	跳转到网上订单列表页面
#    When 	操作 录入信息
#      |网上订单|网上订单|||||||付款时间|下载时间|发货时间|订单金额|商品数量|商品编号|条形码|地址||
#      |    |    |||||||    |    |    |    |    |
#    And     操作 查询
#    Then 	查询结果不显示
#    And 	查询失败



